import React from "react";
import Article from "./Article";

const HowToLEarnSHAD = () => {
  return (
    <Article articleName={"How to learn SHAD?"}>
      <p>
        {" "}
        Всем понятно, что программа и материалы для подготовки, опубликованные на официальном{" "}
        <a href="https://academy.yandex.ru/dataschool/">сайте</a> ШАДа— разводка: программа даже не соответствует
        вариантам прошлых лет, а на собесе вас могут спросить все, что угодно (даже тюремные загадки). Все это только
        набивает цену подборки, которая составлена пошагово: каждый шаг невозможен без предыдущего, а точка входа—
        уверенное владение школьной программой СОШ. Также хочу отметить, что подборка очень боевая несмотря на свою
        объемность: не вошедшие темы возможно собирать разве что по крупицам.
      </p>
      <p>
        <strong>Шаг 0.</strong>
      </p>
      <p>Посвятим его освоению &quot;олимпиадных тем&quot;: комбинаторика, теория чисел, принцип Дирихле, графы.</p>
      <ol>
        <li>
          <em>&quot;Ленинградские математические кружки&quot; С. А. Генкин.</em>{" "}
        </li>
      </ol>
      <p>Книжка , ставшая классикой. Разбираем все. </p>
      <ol>
        <li>
          <a href="https://problems.ru/">Problems.ru</a>
        </li>
      </ol>
      <p>
        К несчастью, ЛМК не покрывают такие темы, как Оценка+Пример, Алгоритм Евклида, что восполняет проблемы своими
        соответствующими разделами.
      </p>
      <p>
        <strong>Шаг 1.</strong>
      </p>
      <p>
        Отчасти совпадает с первым семестром классической программы по математике. Если Вы начинающий вам можете
        пригодиться подборка <a href="https://t.me/postypashki_old/545">How to заботать матешу перед ВУЗом</a>.
      </p>
      <p>
        <strong>Теория множеств.</strong>
      </p>
      <ol>
        <li>
          <em>&quot;Элементы теории множеств&quot; Н. К. Верещагин, А. Шень.</em>{" "}
        </li>
      </ol>
      <p>Разбираем только 1.1-1.4 </p>
      <p>
        <strong>Математический анализ.</strong>
      </p>
      <ol>
        <li>
          <em>Первый семестр</em>{" "}
          <a href="https://teach-in.ru/course/calculus-shaposhnikov-part1?ysclid=l59kjnx8xn293785650">курса</a>{" "}
          <em>С. В. Шапошникова</em>.{" "}
        </li>
      </ol>
      <p>
        Советуем внимательно отнестись не только к определениям, но к доказательствам, ибо конструкции оттуда
        используется при решении задач. По этой же причине советую время от времени поглядывать за примерами в{" "}
        <em>Зорича</em>, <em>&quot;Контр примеры в анализе&quot;.</em>
      </p>
      <ol>
        <li>
          <a href="https://vk.com/id19160711?w=wall19160711_2022%2Fall">Семинары</a>{" "}
          <em>первого семестра А. Сукабичевского</em>.{" "}
        </li>
      </ol>
      <p>Разобраны все основные задачи стандартного курса.</p>
      <ol>
        <li>
          <em>&quot;Математический анализ в задачах и упражнениях&quot; том 1 И. А. Виноградова и другие</em>.
        </li>
      </ol>
      <p>
        Разбираем только главы 1-5. Помимо кучи задач, в том числе теоретических (к несчастью, искусственных) есть
        теоритический материал с примерами решения основных задач.{" "}
      </p>
      <ol>
        <li>
          <em>Листик по монотонности от М. А.</em>{" "}
        </li>
      </ol>
      <p>
        В стандартном курсе анализа редко разбираются задачи на монотонность, хотя они встречаются даже в абитуриентских
        олимпиадах.
      </p>
      <ol>
        <li>
          <em>&quot;Комбинаторика&quot; Н. Я. Виленкин и другие.</em>
        </li>
      </ol>
      <p>Смотрим рекуррентные соотношения. </p>
      <p>
        <strong>Алгебра</strong>.
      </p>
      <ol>
        <li>
          <a href="https://teach-in.ru/course/algebra1-seminars-kanunnikov?ysclid=l59kpr95rn960649268">Семинары</a>{" "}
          <em>А. Л. Канунников</em>.
        </li>
      </ol>
      <p>
        Теория по стандартному курсу элементов алгебры вас больше запутает, в ней нет ничего интересного— только
        справочный формализм. Поэтому разбираем только семы и задачи.
      </p>
      <ol>
        <li>&quot;Перестановки: все что вы хотели знать о них, но боялись спросить&quot; Егор Ясинский</li>
      </ol>
      <p>Название говорит само за себя.</p>
      <ol>
        <li>
          <em>&quot;Сборник задач по алгебре&quot; А. И. Кострикин</em>{" "}
        </li>
      </ol>
      <p>
        Думаю вам вполне хватит <em>Канунникова</em>, но на всякий случай.
      </p>
      <ol>
        <li>
          <em>&quot;Алгебра и теория чисел для математических школ&quot; Н. Б. Алфутова, А. В. Устинов</em>
        </li>
      </ol>
      <p>Смотрим раздел многочлены. </p>
      <p>
        <strong>Аналитическая геометрия.</strong>
      </p>
      <p>
        Как таковой в ШАДе нет, а что есть решается проекцией линала на R^2, R^3. Но геометрией полезно осязать линал
        малых размерностях, да и поможет в следующих курсах.{" "}
      </p>
      <ol>
        <li>
          <a href="https://teach-in.ru/course/analytic-geometr-seminars-penskoy">Семинары</a>{" "}
          <em>по ангему А. В. Пенской.</em>
        </li>
      </ol>
      <p>Разбираем семинары 1-14.</p>
      <ol>
        <li>
          <em>&quot;Сборник задач по аналитической геометрии и линейной алгебре&quot; Смирнов Ю. М.</em>
        </li>
      </ol>
      <p>По нему идет Пенской, решаем соответствующие темы. </p>
      <p>
        <strong>Алгебраические структуры.</strong>
      </p>
      <p>Группы, кольца, поля и т.д. встречаются только на уровне определений. </p>
      <ol>
        <li>
          <a href="https://teach-in.ru/course/algebra-arzhantsev">Курс</a> <em>лекций И. В. Аржанцева</em>.
        </li>
      </ol>
      <p>Смотрим соответствующие лекции. На пальцах объяснены смежные классы и теорема Лангранжа</p>
      <ol>
        <li>
          <em>&quot;Теорема Абеля в задачах и решениях&quot; В. Б. Алексеев</em>.
        </li>
      </ol>
      <p>
        Куча простых задач на теорию групп, решаем одну за другой— и понимание не заставит себя ждать. Все в лучших
        советский традициях: только определения и задачи. К несчастью, капиталисты в конце поместили решения.
      </p>
      <ol>
        <li>
          <em>&quot;Введение в алгебру. Часть 1&quot; А. И. Кострикин.</em>{" "}
        </li>
      </ol>
      <p>Листаем на уровне определений соответствующую главу про залупы, кольца, поля.</p>
      <p>
        Также будет полезно посмотреть{" "}
        <a href="https://t.me/postypashki_old/716">
          <strong>How to заботать алгебру и аналитическую геометрию</strong>
        </a>
        .{" "}
      </p>
      <p>
        После этих шагов вам ничего не мешает ботать <strong>алгосы и структуры данных</strong>: смотрим{" "}
        <a href="https://t.me/postypashki_old/700">
          <strong>How to заботать алгоритмы</strong>
        </a>{" "}
        (раздел никак особо не связан с последующими шагами).
      </p>
    </Article>
  );
};
export default HowToLEarnSHAD;
