import React from "react";
import Article from "./Article";

const ITEventsNN = () => {
  return (
    <Article articleName={"It Events In NN"}>
      <h2 id="-tinkoff-senior-backend-day-https-meetup-tinkoff-ru-conference-backend-day-">
        <a href="https://meetup.tinkoff.ru/conference/backend-day/">Tinkoff Senior Backend Day</a>
      </h2>
      <p>Суббота, 21 октября 2023 12:00 Нижний Новгород, &quot;Академия Маяк&quot; им. А.Д. Сахарова</p>
      <p>
        Тинькофф проведет большой бэкенд-ивент в Нижнем Новгороде 🍁 С докладами по архитектуре, Java, Python и .NET и
        афтерпати после. И все это — Tinkoff Senior Backend Day В основной программе — четыре кейса для мидлов и тех,
        кто выше:
      </p>
      <ul>
        <li>поговорим про API First;</li>
        <li>обсудим способы взаимодействия с Kafka;</li>
        <li>рассмотрим особенности разработки систем с низкой нагрузкой;</li>
        <li>расскажем, как эффективно утилизировать ресурсы.</li>
      </ul>
      <p>
        Между докладами можно проверить вашу скорость набора кода, поностальгировать в «крестиках-ноликах» и больших
        пазлах, а еще почиллить в лаундж-зоне и просто тепло поболтать со спикерами и другими участниками.
      </p>
      <h2 id="-1c-it-lad-https-www-it52-info-events-2023-11-12-besplatnaya-1c-stazhirovka-v-it-akademii-lad-">
        <a href="https://www.it52.info/events/2023-11-12-besplatnaya-1c-stazhirovka-v-it-akademii-lad">
          Бесплатная 1C-стажировка в IT-академии Lad
        </a>
      </h2>
      <p>Воскресенье, 12 ноября 2023 15:44 ONLINE</p>
      <p>В IT-компании Lad стартует отбор на бесплатную стажировку 1С!</p>
      <p>
        Вы пройдете стажировку под руководством опытных специалистов 1С - от технического задания до проекта,
        автоматизирующего хозяйственную деятельность предприятия на базе 1С:ERP. Для старта нужны базовые знания и
        навыки в выбранном направлении.
      </p>
      <p>
        Мы настроим вашу работу в соответствии с этапами классического проекта внедрения 1С ERP компании Lad. Изучим
        функциональные возможности ключевого продукта фирмы 1С. Поработаем с наиболее частотными запросами клиентов .
      </p>
      <p>Вместе с вами над проектом будут работать стажеры - программисты 1С и аналитики.</p>
      <p>
        В стажировку входят планерки, встречи с заказчиком и демо. Такой подход приближает процессы к реальной работе
        1С-команд и ускорит вашу адаптацию в компании после трудоустройства.
      </p>
      <p>
        <strong>Выбирайте направление, знакомьтесь с информацией по стажировке и регистрируйтесь:</strong>
      </p>
      <ul>
        <li>
          <a href="https://lad-academy.ru/stazhirovka-programmisty-1c">Программирование</a>{" "}
        </li>
        <li>
          <a href="https://lad-academy.ru/stazhirovka-analitikov-1c">Аналитика</a>
        </li>
      </ul>
      <p>При регистрации обязательно укажите свои навыки и опыт работы.</p>
      <h2 id="-tensor-tech-party-https-www-it52-info-events-2023-11-16-tensor-tech-party-">
        <a href="https://www.it52.info/events/2023-11-16-tensor-tech-party">TENSOR TECH PARTY</a>
      </h2>
      <p>Четверг, 16 ноября 18:30 пр-кт Гагарина, 27. Гранд-отель &quot;Ока&quot;, конференц-зал &quot;Премьер&quot;</p>
      <p>16 ноября в Нижнем Новгороде пройдет Митап для опытных и продвинутых разработчиков.</p>
      <p>
        Приедут ведущие специалисты Тензора, готовые обсудить нестандартные подходы, неочевидные решения и поделиться
        бесценным опытом.
      </p>
      <p>
        <strong>В программе 4 уникальных доклада:</strong>
      </p>
      <ol>
        <li>
          <strong>«SQL HowTo: Алгоритмы на графах»</strong>
          <em>
            Превратим муху в слона с помощью PostgreSQL и построим лабиринт, используя геометрические типы данных.
          </em>
        </li>
        <li>
          <strong>«ABR для живых трансляций»</strong>
          <em>Расскажем как строить коммуникацию с командой на основе поведенческих типов. Выясним, какая птица ты?</em>
        </li>
        <li>
          <strong>«Реджекты мобильных приложений»</strong>
          <em>Галя, у нас отмена! Или что делать, если ваше приложение было отклонено в маркете?</em>
        </li>
        <li>
          <strong>«Как нейросети учились понимать нас: история до GPT-4»</strong>
          <em>Обсудим как работает и развивается искусственный интеллект, и чего нам ждать в будущем.</em>
        </li>
      </ol>
      <p>Полезная информация, новые знакомства и обмен опытом — вот, что ждет на TENSOR TECH PARTY.</p>
    </Article>
  );
};
export default ITEventsNN;
