import React from "react";
import Article from "./Article";

const MathematicalAnalysis = () => {
  return (
    <Article articleName={"Mathematical analysis"}>
      <p>
        <strong>Что с теорией?</strong>{" "}
      </p>
      <p>
        1) Начинающим очень советуем <a href="https://teach-in.ru/course/calculus-shaposhnikov-part1"></a>
        <em>курс</em> <a href="https://teach-in.ru/course/calculus-shaposhnikov-part1"></a>
        <em>С. В. Шапашникова</em>, который читается на мехмате. Не знаю, кто ещё с большей заботой подошёл к своему
        курсу: все темы и доказательства выбраны с умом, и без излишней пелены &quot;всеобщности&quot;, когда простые
        вещи пытаются объяснить общими конструкциями функана. Мне самому очень нравится, как построен второй семестр.{" "}
      </p>
      <p>
        Есть <a href="https://teach-in.ru/course/calculus-shaposhnikov-part1">записи</a> лекций и конспекты, даже
        официальный <a href="http://cmt.teacher.msu.ru/wiki/matan">сайт</a>, на котором можно посмотреть теор листки и
        рабочие конспекты с задачами.{" "}
      </p>
      <p>
        2) <em>&quot;Математический анализ&quot; В. А. Зорич.</em>{" "}
      </p>
      <p>Наверное любой мехматянин будет опираться в своем курсе мат анализа на этот учебник. </p>
      <p>
        Немного уже устаревший курс, что закрывает своей полнотой. Мы бы не советовали его как основу начинающими из-за
        специфики: например, тот же предел, интеграл рассматривается в основном только по базе.{" "}
      </p>
      <p>
        Но на самом деле курс наиболее ценен своими примерами и очень интересными теор задачами, которые постоянно
        попадают в ваши листки.{" "}
      </p>
      <p>
        3) <em>&quot;Контрпримеры в анализе&quot; Б. Гелбаум, Дж. Олмстед.</em>{" "}
      </p>
      <p>
        Сборник тонкостей, стандартных приемов и ответов на вопросы, почему в той или иной теореме мы требует то или
        иное условие. И как мы знаем, невозможно идти на экзамен по мат анализу без набора примеров и контрпримеров.{" "}
      </p>
      <p>
        4) <em>&quot;Курс математического анализа&quot; Л. Д. Кудрявцев.</em>{" "}
      </p>
      <p>
        Наверное, любой физтех будет опираться в своем курсе мат анализа на этот учебник. Изложение простое и очень
        непрерывное в сравнении с другими: приходится внимательно следить за каждой строчкой, а разбиение на отдельные
        &quot;леммы&quot;, &quot;теоремы&quot; условны и есть просто часть доказательства следующего утверждения.{" "}
      </p>
      <p>
        5){" "}
        <em>
          &quot;Основы математического анализа&quot; и &quot;Курс дифференциального и интегрального исчисления&quot; Г.
          М. Фихтенгольц.
        </em>{" "}
      </p>
      <p>
        Наверное, любой на матмехе будет опираться в своем курсе на эти учебники. Язык устаревший, но все излагается
        очень доступно— будет понятно даже школьнику.{" "}
      </p>
      <p>
        <strong>Что порешать?</strong>{" "}
      </p>
      <p>
        1) <em>&quot;Сборник задач и упражнения по математическому анализу&quot; Б. П. Демидович.</em>{" "}
      </p>
      <p>
        Классический задачник на все темы мат. анализа. Единственно, нет примеров решения стандартных задач. Но это
        выкупается <em>&quot;Антидемидовичем&quot;</em>+ повод выучить китайский.{" "}
      </p>
      <p>
        2) <em>&quot;Математический анализ в задачах и упражнениях&quot; И. А. Виноградова и другие.</em>{" "}
      </p>
      <p>
        Задачник задумывался как материал семинаров. Труд постоянно редактируется и переиздается: есть удачные тома и не
        очень. Из очень хорошего можно отметить, что много примеров решения задач, есть кратная теоретическая выжимка в
        начале каждой главы и также интересные теоретические задачи.{" "}
      </p>
      <p>
        3) <em>&quot;Сборник задач по математическому анализу&quot; Л. Д. Кудрявцев и другие</em>{" "}
      </p>
      <p>
        4) <em>Problems.ru</em>{" "}
      </p>
      <p>Сайт больше для школьников, но скоромная подборка по некоторым темам анализам тоже есть. </p>
      <p>
        5) <em>&quot;Интегралы и Ряды&quot; А. П. Солодов</em>{" "}
      </p>
      <p>Прикольная методичка с задачами и решениями, отчасти копипаст Демидовича. </p>
      <p>
        <strong>Где встречаются разборы задач?</strong>{" "}
      </p>
      <p>Помимо вышеперечисленного. </p>
      <p>
        1) <em>Семинары с ФПМИ А. А.</em>{" "}
        <a href="https://vk.com/id19160711">
          <em>Сукабичевский</em>
        </a>
        <em>.</em>{" "}
      </p>
      <p>
        Качественный материал: разобраны типичные задачи, обсуждение теории. К несчастью, в программу семинаров входят
        не все классические темы мат{" "}
      </p>
      <p>анализа.</p>
      <p>
        2){" "}
        <a href="https://teach-in.ru/course/1?tag=entangled%7C%D1%88%D0%BA%D0%BE%D0%BB%D1%8C%D0%BD%D0%B8%D0%BA%D0%B0%D0%BC%7C%D0%BB%D0%B5%D0%BA%D1%86%D0%B8%D0%B8%7C%D1%81%D0%BF%D0%B5%D1%86%D0%BA%D1%83%D1%80%D1%81%7C%D1%81%D0%B5%D0%BC%D0%B8%D0%BD%D0%B0%D1%80%D1%8B%7C%D0%BD%D0%B0%D1%83%D1%87%D0%BD%D1%8B%D0%B9%D0%B4%D0%BE%D0%BA%D0%BB%D0%B0%D0%B4%7C%D0%BC%D1%84%D0%BA&amp;sort=title_asc&amp;search=%D0%BC%D0%B0%D1%82%D0%B5%D0%BC%D0%B0%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9%20%D0%B0%D0%BD%D0%B0%D0%BB%D0%B8%D0%B7">
          <em>Семинары</em>
        </a>{" "}
        <em>преподавателей МГУ</em>{" "}
      </p>
      <p>
        3){" "}
        <a href="https://mipt.ru/online/hi-Math/matan/?">
          <em>Семинары</em>
        </a>{" "}
        <em>преподавателей физтеха</em>{" "}
      </p>
    </Article>
  );
};
export default MathematicalAnalysis;
